[
 {
   "A": "A manufacturer sells an article at a profit of 25% to a wholesale dealer, who sells it to a retailer at a profit of 5%. The retailer sells it for Rs. 756 and makes a profit of 20%. The cost of the article to the manufacturer is",
   "B": "Rs. 420",
   "C": "Rs. 560",
   "D": "Rs. 240",
   "E": "Rs. 480",
   "F": 4
 },
 {
   "A": "A man travels from A to B to buy goods which he can get 10% cheap in B than in A. If the expenses of the journey are Rs. 15 and he makes a clear saving of Rs. 10 what does he pay for the goods?",
   "B": "Rs.230",
   "C": "Rs. 215",
   "D": "Rs. 200",
   "E": "Rs. 225",
   "F": 4
 },
 {
   "A": "A reduction of 40% in the price of bananas would enable a purchaser to obtain 60 more Rs. 45. What is the reduce price.",
   "B": "30P",
   "C": "60P",
   "D": "45P",
   "E": "75P",
   "F": 1
 },
 {
   "A": "A sells a horse to B for Rs. 4860, thereby losing 19%, B sells it to C at a price which would have given A 17% profit. Find B’s gain.",
   "B": "Rs. 2264",
   "C": "Rs. 2617",
   "D": "Rs. 2160",
   "E": "Rs. 2438",
   "F": 3
 },
 {
   "A": "A trader advertises for selling the cloth at 5% loss, but by using a false meter scale he actually gains 20%. What is the actual length of the scale?",
   "B": "0.75m",
   "C": "0.8m",
   "D": "0.6m",
   "E": "0.5m",
   "F": 2
 },
 {
   "A": "A sold a watch to B at 10% loss. B sold it to C at 11.11% loss and c again sold it to A at 12.5% profit. How much profit/loss % is incurred by A? ",
   "B": " 10% profit ",
   "C": " 12% profit ",
   "D": "10% loss ",
   "E": "No profit no loss ",
   "F": 4
 },
 {
   "A": "A man bought some toffees at the rate of 3 toffees per Re. and same number at the rate of 2 toffees per Re. He mixes them and sold 3 toffees for Rs 2. Find his profit/loss% in the whole transaction",
   "B": "20% loss ",
   "C": "20% profit ",
   "D": " 60% loss ",
   "E": " 60% profit ",
   "F": 4
 },
 {
   "A": "A dishonest dealer professes to sell his goods at 10% profit on Cost Price and also uses a false weight and gives 900 grams instead of 1 kg. Find his total gain",
   "B": "0.1111",
   "C": "0.2222",
   "D": "0.2111",
   "E": "0.211",
   "F": 2
 },
 {
   "A": "The marked price of an article is 60% above the cost price. When marked price is increased by 30% and selling price is increased by 20%, then the profit doubles. What is the original selling price if marked price is Rs 3200? ",
   "B": " Rs 2500 ",
   "C": "Rs 3000 ",
   "D": "Rs 2000 ",
   "E": "Rs 4160 ",
   "F": 1
 },
 {
   "A": "Nikita bought 30kg of wheat at the rate of 9.50/kg of wheat and the same amount of wheat at the rate of Rs8.50 per kg and mixed them. She sold the mixture at the rate of Rs 8.90/kg. Find her total profit or loss in the whole transaction? ",
   "B": " Rs2 profit ",
   "C": " Rs6 loss ",
   "D": "Rs2 loss ",
   "E": "Rs6 profit ",
   "F": 2
 },
 {
   "A": "A customer saves Rs400 at the rebate of 20% on market price of an article. If the cost price of the article for shopkeeper is Rs1200.Then find the profit percent of shopkeeper? ",
   "B": " 33(1/3)% ",
   "C": "0.25",
   "D": "0.2",
   "E": "16(2/3)% ",
   "F": 1
 },
 {
   "A": "A dishonest shopkeeper sells milk at 20% gain and also he add water in the ratio 4:1 in it. What is his total profit? ",
   "B": "50",
   "C": "45",
   "D": "40",
   "E": "44",
   "F": 1
 },
 {
   "A": "A businessman sells a commodity at 10% profit. If he had bought it 10% less and sold it for rs2 less, then he would have gained 16(2/3)%. What is the cost price of the commodity",
   "B": "32",
   "C": "48",
   "D": "36",
   "E": "40",
   "F": 2
 },
 {
   "A": "The price of an article increase by 20% and a man now get 10kg less, if he also reduce his consumption by 20%, then find how much kg of article he used to purchase in normal price? ",
   "B": " 15kg ",
   "C": " 20kg ",
   "D": " 30kg ",
   "E": "40kg",
   "F": 3
 },
 {
   "A": "A trader marked his goods at such a price that after allowing a discount of 12(1/2) % for cash payment, he makes a profit of 20% . What is the marked price of the good which costs Rs. 210 ? ",
   "B": " Rs.300 ",
   "C": " Rs.210 ",
   "D": "Rs.470 ",
   "E": " Rs. 288 ",
   "F": 4
 },
 {
   "A": "",
   "B": "",
   "C": "",
   "D": "",
   "E": "",
   "F": null
 },
 {
   "A": " A camel and a cart together cost Rs. 5000.If  by selling the camel at a profit of 10% and the cart at a loss of 10% a total profit of 2.5% is made ,then what is the cost price of the camel ? ",
   "B": " Rs.4500 ",
   "C": " Rs. 3125 ",
   "D": " Rs. 3000 ",
   "E": " Rs.2100 ",
   "F": 2
 },
 {
   "A": "Sonata sells a wrist watch to a wholeseller making a profit of 10%. The wholesaler sells it to the retailer making a profit of 10%. A customer purchases it by paying Rs.990. Thus the profit of retailer is 2(3/11)% what is the cost incurred by the Sonata to produce it? ",
   "B": " Rs.755 ",
   "C": "Rs.950 ",
   "D": "Rs.850 ",
   "E": "Rs.800 ",
   "F": 4
 },
 {
   "A": "A person sells two fans for Rs. 6800. The cost price of the first fan is equal to the selling price of the second fan. If the first is sold at 30% loss and the second at 100% gain, what is total profit or loss (in rupees)? ",
   "B": "750",
   "C": "800",
   "D": "670",
   "E": "580",
   "F": 2
 },
 {
   "A": "In a certain store, the profit is 270% of the cost. If the cost increases by 30% but the selling price remains constant, approximately what %ge of the selling price is the profit. ",
   "B": "68",
   "C": "72",
   "D": "50",
   "E": "65",
   "F": 4
 },
 {
   "A": " A person X sold an Item to Y at 40% loss, then Y sold it to third person Z at 40% profit and finally Z sold it back to X at 40% profit. In this whole process what is the percentage loss or profit of X? ",
   "B": "70",
   "C": "62.5",
   "D": "57.6",
   "E": "55",
   "F": 3
 },
 {
   "A": "A person wants to sell his goods at 20% profit after allowing a discount of 16 2/3% on marked price. How much % above the cost price should he mark his article? ",
   "B": "20",
   "C": "36.666666666666664",
   "D": "34.833333333333336",
   "E": "44",
   "F": 4
 },
 {
   "A": "On selling 15 balls at Rs 400 there is loss equal to Cost Price of 5 balls. The cost price of a ball is? ",
   "B": "20",
   "C": "30",
   "D": "40",
   "E": "50",
   "F": 3
 },
 {
   "A": "A man buys some toffees at 3 in Re. 1 and some at 3 in Rs 2 and sold them at 1 in Re. 1. Find his gain or loss %. ",
   "B": " 200% loss ",
   "C": "200% profit ",
   "D": "100% loss ",
   "E": "100% profit ",
   "F": 4
 },
 {
   "A": "An article passes successfully in the hand of three traders. Each trader sold it further at a gain of 20% of the cost price. If the last trader sold it for Rs 432 then what was the cost price? ",
   "B": " Rs 125 ",
   "C": " Rs 256 ",
   "D": " Rs 250 ",
   "E": " Rs 432 ",
   "F": 3
 },
 {
   "A": "By selling 12 marbles for a rupee, a shopkeeper loses 20% . In order to gain 20% in the transaction , he should sell the marbles at the rate of how many  marbles for a rupee? ",
   "B": "14",
   "C": "8",
   "D": "11",
   "E": "9",
   "F": 2
 },
 {
   "A": "A shopkeeper bought a DVD marked at Rs. 200 at successive discounts of 10% and 15% respectively. He spent Rs. 7 on transport and sold the table for Rs.208 .What will be his profit percentage ? ",
   "B": "58",
   "C": "44",
   "D": "30",
   "E": "50",
   "F": 3
 },
 {
   "A": "A dishonest trader marks up his goods by 80% and gives discount of 25% . Besides he gets 20% more amount per kg from wholeseller and sells 10% less per kg to customer. What is the overall profit percentage ? ",
   "B": "63",
   "C": "72",
   "D": "88",
   "E": "80",
   "F": 4
 },
 {
   "A": "If Joel sells an article at 4/5th of its selling price and secures a profit of 20%, what will be the profit or loss percentage if he sells it at the actual selling price? ",
   "B": "45",
   "C": "60",
   "D": "50",
   "E": "56",
   "F": 3
 },
 {
   "A": "A person X sold an Item to Y at 40% loss, then Y sold it to third person Z at 40% profit and finally Z sold it back to X at 40% profit. In this whole process what is the percentage loss or profit of X? ",
   "B": "70",
   "C": "62.5",
   "D": "57.6",
   "E": "55",
   "F": 3
 },
 {
   "A": "If a person reduce his selling price of an article by rs40 then the suggested profit of 33(1/3)% convert into loss of 20%. Find the cost price",
   "B": " Rs60 ",
   "C": " Rs75 ",
   "D": "Rs100 ",
   "E": "Rs150 ",
   "F": 2
 }
]