[
 {
   "A": ")A man travels a distance of 24km at 6 km/hr. Another distance of 24km at 8 km/hr and a third distance of 24km at 12 km/hr. His average speed for the whole journey is",
   "B": "8 km/hr",
   "C": "9 km/ hr",
   "D": "8.75 km/hr",
   "E": "10 km/hr",
   "F": 1
 },
 {
   "A": "A person travels four equal distances of 3km each at a speed of 10 km/hr, 20 km/hr, 30 km/hr and 60 km/hr respectively. Find his average speed for the whole journey is",
   "B": "18 km/hr",
   "C": "25km/hr ",
   "D": "21 km/hr",
   "E": "20km/hr",
   "F": 4
 },
 {
   "A": ")A man completes 30 km of a journey at the speed of 6 km/hr and the remaining 40 km of the journey in 5 hours. His average speed for the whole journey is.",
   "B": "7 km/hr",
   "C": "7.25 km/hr8 km/hr",
   "D": "",
   "E": "7.5 km/hr",
   "F": 1
 },
 {
   "A": "One-third of a certain journey is covered at a rate of 40 km/hr one-fourth at the rate of 30 km/hr and the rest at 25 km/hr. The average speed for the whole journey is.",
   "B": "35 km/hr",
   "C": "33 km/hr",
   "D": "30 km/hr",
   "E": "34 km.hr",
   "F": 3
 },
 {
   "A": "When a person cycled at 10 km/hr he arrived at his office 6 minutes late. He arrived 6 minutes early when he increased his speed by 2 km per hour. The distance of his office from the starting place is",
   "B": "12 km",
   "C": "6km",
   "D": "7 km",
   "E": "16 km",
   "F": 1
 },
 {
   "A": "An aeroplane started its journey half hour late to cover a distance of 1500 km on time it increases its speed by 250 km/hr find its original speed",
   "B": "700km/hr",
   "C": "650km/hr",
   "D": "750 km/hr",
   "E": "600km/hr",
   "F": 3
 },
 {
   "A": "By walking at 6/7 of his usual speed, a man reaches his office 25 minutes later than his usual time. The usual time taken by him to reach his office is",
   "B": "2hurs 30 minutes",
   "C": "2hurs 25 minutes",
   "D": "2hurs 15 minutes",
   "E": "2hurs 10 minutes",
   "F": 1
 },
 {
   "A": "Walking at 3/4 of his usual speed, a man covers a certain distance in 2 hours more than the time he takes to cover the distance at his usual Speed. The time taken by him to cover the distance with his usual speed is",
   "B": "5 hours",
   "C": "7hours",
   "D": "6hours",
   "E": "5.5 hours",
   "F": 3
 },
 {
   "A": "A train 50 meters long passes a platform of length 100 meters in 10 seconds. The speed of the train in metre/second is.",
   "B": "10",
   "C": "50",
   "D": "20",
   "E": "15",
   "F": 4
 },
 {
   "A": "A train 300 meters long is running at a speed of 54 km/hr. In what time will it cross a telephone pole?",
   "B": "18 seconds",
   "C": "17 seconds",
   "D": "20 seconds",
   "E": "15 seconds",
   "F": 3
 },
 {
   "A": "A train passes a platform 110 m long in 40 seconds and a boy standing on the platform in 30 seconds. The length of the train is.",
   "B": "220 m",
   "C": "110 m",
   "D": "330 m",
   "E": "100 m",
   "F": 3
 },
 {
   "A": "Two trains of equal length are running on parallel lines in the same direction at the rate of 46 km/hour and 36 km/hour. The faster train passes the slower train in 36 seconds the length of each train is.",
   "B": "82 m",
   "C": "80 m",
   "D": "72 m",
   "E": "50 m",
   "F": 4
 },
 {
   "A": "A train passes two persons walking in the same direction at a speed of 3 km/hour and 5 km/hour respectively in 10 seconds and 11 seconds respectively. The speed of the train is.",
   "B": "25km/hr",
   "C": "27km/hr",
   "D": "24km/hr",
   "E": "30km/hr",
   "F": 1
 },
 {
   "A": "A train passes two persons walking in opposite direction at a speed of 5 m/second and 10 m/second respectively in 6 seconds and 5 seconds respectively. Find the length of the train is.",
   "B": "140 metres",
   "C": "150 metres",
   "D": "180 metres",
   "E": "160 metres",
   "F": 2
 },
 {
   "A": "Two trains start at the same time from Aligarh and Delhi and proceed towards each other at the rate of 14 km and 21 km per hour respectively. When they meet, it is found that one train has traveled 70 kilometers more than the other. The distance between two stations is.",
   "B": "300 km",
   "C": "210 km",
   "D": "350 km",
   "E": "140 km",
   "F": 3
 },
 {
   "A": "Two trains of equal length take 10 seconds and 15 seconds respectively to cross a Telephone pole. If the length of each train is 120 m. In what time will they cross Each Other traveling in opposite direction?",
   "B": "10 sec",
   "C": "12 sec.",
   "D": "16 sec.",
   "E": "15 sec",
   "F": 2
 },
 {
   "A": "P and Q are 27 km away. Two trains with speed of 24 km/hr and 18 km/hr respectively start simultaneously from P and Q and travel in the same direction. They meet at a point R beyond Q. Distance QR is.",
   "B": "48 km",
   "C": "81 km",
   "D": "36 km",
   "E": "126 km",
   "F": 2
 },
 {
   "A": "If a person walks at 14 km/hr instead of 10 km/hr, he would have walked 20 km more. The actual distance travelled by him is:",
   "B": "50km",
   "C": "56km",
   "D": "70km",
   "E": "80km",
   "F": 1
 },
 {
   "A": "The ratio between the speeds of two trains is 7 : 8. If the second train runs 400 kms in 4 hours, then the speed of the first train is",
   "B": "70 km/hr",
   "C": "75 km/hr",
   "D": "84 km/hr",
   "E": "87.5 km/hr",
   "F": 4
 },
 {
   "A": "How long will a boy take to run round a square field of side 35 metres, if he runs at the rate of 9 km/hr ?",
   "B": "50 sec",
   "C": "52 sec",
   "D": "54 sec",
   "E": "56 sec",
   "F": 4
 },
 {
   "A": "Moni left for Bangalore from Chennai at 9.30 am. She travelled at the speed of 60 km/hr for 2 hrs 15 mins. After she reduced the speed to 40 km/hr. If the distance between the 2 cities is 285 km, at what time did moni reach",
   "B": "2.30 pm",
   "C": "3.30 pm",
   "D": "0.6666666666666666",
   "E": "",
   "F": 2
 }
]